# Shared IDE extensions (both VSCode and Cursor)

# Languages
golang.go
mathiasfrohlich.kotlin
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
rust-lang.rust-analyzer
shopify.ruby-lsp

# Infrastructure
hashicorp.terraform
ms-vscode.makefile-tools

# Utilities
ms-vscode.powershell
tomoki1207.pdf

# Agents
anthropic.claude-code
